[
    "A street merchant inexplicably gives you a small discount on your next purchase.",
    "You find a coin in your boot that wasn't there before. It's warm to the touch.",
    "A stray cat follows you for the rest of the day and hisses at anyone who lies to you.",
    "The next lock you encounter is slightly rusted in your favor.",
    "A dead ancestor whispers a single useful word in your sleep tonight.",
    "A bird drops a small, shiny key at your feet. It fits something nearby.",
    "Your weapon gleams with a faint light the next time you draw it. Purely cosmetic, but intimidating.",
    "A travelling merchant owes you a favor they can't quite remember why.",
    "The weather shifts subtly in your favor for the next outdoor encounter.",
    "You wake up tomorrow feeling unusually well-rested. No reason. Just vibes.",
    "A clockwork beetle crawls out of a crack in the wall and delivers a tiny, helpful note.",
    "The next trap you encounter makes an audible click just before triggering.",
    "A drunk oracle stumbles past you and mutters something surprisingly relevant.",
    "Your rations taste inexplicably better today. Morale is high.",
    "A minor spirit of curiosity decides to orbit your head for the next hour, illuminating dark corners.",
    "The next rope you climb feels unusually sturdy and cooperative.",
    "A stranger in a tavern buys you a drink and refuses to explain why.",
    "Your armor feels lighter today. Not mechanically, just... lighter.",
    "A raven lands on your shoulder and caws once in the direction of hidden danger.",
    "You discover an extra healing potion wedged in the lining of your pack. How long has that been there?",
    "The next person you try to persuade is in an uncommonly good mood.",
    "A gentle tailwind follows you for the rest of the day.",
    "Your campfire tonight burns cleaner, warmer, and requires less fuel.",
    "A child hands you a crudely drawn map. One landmark on it is actually accurate.",
    "The next door you open doesn't creak.",
    "A butterfly lands on your weapon hand. Your next strike feels guided.",
    "You overhear a conversation that contains one genuinely useful piece of information.",
    "A cobblestone shifts underfoot, revealing a small hidden compartment beneath.",
    "Your reflection in water winks at you. Nothing happens, but it's reassuring.",
    "The next potion you drink tastes like your favorite childhood meal.",
    "A gear-sprite has oiled your equipment overnight. Everything moves smoothly.",
    "You find a four-leaf clover pressed inside a book. Someone left it there on purpose.",
    "A passing cloud briefly shapes itself into an arrow pointing the right direction.",
    "The next NPC you speak to happens to be in a talkative mood.",
    "A small clockwork mouse delivers a copper piece to your bedroll. Its origin is unclear.",
    "Your boots don't get muddy today, despite the terrain.",
    "The stars tonight seem to form a pattern only you can read. It suggests patience.",
    "A street performer's song gives you a sudden flash of insight about your current problem.",
    "The next critical failure you witness happens to your enemy instead.",
    "A tinkerer offers to adjust one of your items for free. Just a minor improvement.",
    "You find a comfortable rock to sit on exactly when you need to rest.",
    "A fox crosses your path three times today. The third time, it drops something small and useful.",
    "The next lie told in your presence sounds just slightly off to your ears.",
    "Your shadow moves independently for a moment and points at something you missed.",
    "A bakery gives you a free pastry because you remind them of someone they liked.",
    "The next pit you almost fall into has convenient handholds along the edge.",
    "A songbird mimics a phrase you needed to hear. Pure coincidence, surely.",
    "Your torch burns an extra hour longer than it should.",
    "A grizzled veteran nods at you with genuine respect as you pass. You've never met them.",
    "The wind carries a scent that reminds you exactly of home. You feel steadied.",
    "A librarian remembers you from a visit you never made and offers you a restricted text.",
    "Your next meal is cooked to absolute perfection by sheer accident.",
    "A clockwork compass in a junk shop spins to point at you, then settles on true north.",
    "The next secret door you search for has a slightly visible seam.",
    "A temple acolyte blesses you in passing. It's minor, but genuine.",
    "You find exactly the right amount of rope for your next task.",
    "A harmless snake coils around your wrist briefly, then slithers toward a hidden path.",
    "The merchant accidentally gives you too much change. They insist you keep it.",
    "Your next Recall Knowledge check feels like remembering rather than guessing.",
    "A breeze blows a wanted poster into your hand. The face on it is useful information.",
    "The next ambush against you starts one round later than intended. Something delayed them.",
    "A child's lost toy that you return earns you unexpected goodwill from an important NPC.",
    "Your next night watch is unusually peaceful. The stars are beautiful.",
    "A gear-driven music box plays a tune that matches your current mood perfectly.",
    "The next poison you encounter smells faintly of almonds, giving you just enough warning.",
    "An old coin you've been carrying turns out to be worth slightly more than expected.",
    "A messenger raven meant for someone else lands on your arm. The message is... interesting.",
    "Your spell component pouch seems slightly heavier today. Something extra is in there.",
    "A dock worker offers to carry your heaviest item for free. No strings attached.",
    "The next illusion you encounter has a faint shimmer at the edges.",
    "A street urchin warns you about a shortcut that's actually legitimate.",
    "Your next rest is undisturbed by dreams. You wake sharp and focused.",
    "A blacksmith tests a blade on your armor and is impressed. Word spreads.",
    "The tide of battle shifts. An enemy trips on something inconvenient.",
    "A potted plant in the next building you enter has a small coin hidden in its soil.",
    "The next magical aura you detect is slightly easier to identify than usual.",
    "A stray dog leads you to a dropped pouch with a few silver pieces.",
    "Your cloak catches the wind dramatically at a socially advantageous moment.",
    "An alchemist gives you a free sample. It's not amazing, but it's not nothing.",
    "The next bookshelf you search has its most useful tome at eye level.",
    "A fortune teller refuses your payment and says you'll need the coin more than her.",
    "Your weapon hits a nerve cluster by pure chance. The enemy flinches.",
    "A mechanical songbird perched on a windowsill sings a melody that calms nearby tensions.",
    "The next guard you encounter is at the end of their shift and doesn't care.",
    "You discover your canteen has kept water colder than it should be. Refreshing.",
    "A monastery bell rings as you pass, and a monk bows to you. Old tradition, they say.",
    "The next wall you need to climb has surprisingly good handholds.",
    "A jeweler identifies something in your possession as slightly more valuable than you thought.",
    "An informant you've never paid suddenly feels chatty.",
    "Your pack seems better organized than you left it. Nothing is missing.",
    "The next forked path you encounter has faded footprints on the correct route.",
    "A steamwork vent blasts warm air at you on a cold day. Perfect timing.",
    "The next disguise you attempt works on someone it really shouldn't have.",
    "A farmer offers you fresh produce for free. Harvest was good this year, they say.",
    "Your next initiative feels faster. Something clicks into place.",
    "A minor water elemental playfully splashes clean water on your face. You feel refreshed.",
    "The next fence you need to jump has a convenient lower section.",
    "A tattoo parlor offers you a free small design. It might be magical. It might not.",
    "Your fire resistance seems slightly better today. Probably your imagination.",
    "A courier delivers a package to the wrong address. Your address. The contents are mildly useful.",
    "The next social encounter starts with the other party already slightly impressed by your reputation.",
    "A temple's donation box spills a few coins in your direction. The priest waves it off.",
    "Your next stealth check benefits from a conveniently timed loud noise nearby.",
    "A cartographer has marked something interesting near your current location. Free of charge.",
    "The next time you're lost, a carved trail marker appears that you're certain wasn't there before.",
    "A bard dedicates a song to you in a tavern. Your reputation improves slightly in this district.",
    "Your next crafting attempt yields slightly better results than expected.",
    "A warehouse door that should be locked is slightly ajar when you arrive.",
    "The next scroll you find is in a language you happen to read.",
    "A soldier shares their field rations with you. Military grade. Not bad.",
    "Your mount seems particularly energetic and sure-footed today.",
    "A gemstone in a shop window catches the light and reveals a flaw. The price drops.",
    "The floor in the next dungeon room is surprisingly clean. Something was here recently.",
    "A herbalist identifies a plant near camp that has mild healing properties.",
    "Your next Perception check catches something at the very edge of your awareness.",
    "A fisherman's catch includes something that isn't a fish. Could be useful.",
    "The next enchanted item you examine resonates faintly with your touch.",
    "A traveling circus performer shows you a trick. It's actually applicable to lockpicking.",
    "Your armor doesn't chafe today. Small mercies.",
    "A gust of wind blows a relevant document off someone's desk and into the street.",
    "The next time you take cover, the cover is slightly more substantial than it looked.",
    "A dwarven merchant admires your gear and offers free maintenance.",
    "Your next ranged attack benefits from an unexpected lull in the wind.",
    "A ghost you can barely see gives you a thumbs up and fades away.",
    "The next riddle or puzzle you encounter reminds you of one you solved as a child.",
    "A clockwork toy in a shop window points at you, then at a nearby alley. Coincidence.",
    "Your bedroll is inexplicably more comfortable tonight.",
    "An enemy's weapon has a hairline crack you notice just before they swing.",
    "A washwoman hanging laundry accidentally drops a clean cloak on you. She insists you keep it.",
    "The next diplomatic encounter starts with an unexpected common interest.",
    "Your rations include a spice packet you don't remember packing. Everything tastes better.",
    "A minor earth tremor reveals the outline of something buried nearby.",
    "The next wanted poster you see has outdated information that works in your favor.",
    "A gnomish inventor gives you a gadget that does exactly one useful thing, once.",
    "Your next Reflex save benefits from muscle memory you didn't know you had.",
    "A ship's captain remembers you fondly from a voyage you barely recall. Free passage offered.",
    "The last page of a torn journal lands at your feet. The contents are relevant.",
    "A cat sleeping on a windowsill stretches and knocks a useful item off the ledge toward you.",
    "The next magical trap you encounter fizzles slightly before activating. You get a warning.",
    "A retired adventurer in a tavern buys a round and shares one actually useful piece of advice.",
    "Your healing feels slightly more effective today. Warm hands.",
    "A street sweeper reveals a storm drain that leads somewhere interesting.",
    "The lock on your room at the inn is surprisingly good. Best sleep in weeks.",
    "A merchant's wagon breaks down near you. Helping them earns genuine, useful gratitude.",
    "Your next Fortitude save is bolstered by a stubborn refusal to be inconvenienced.",
    "A pigeon delivers a message clearly meant for someone else. The contents are intriguing.",
    "The next darkness you enter has a faint phosphorescent moss you can almost navigate by."
]
